# YOLOv12-三华李-C2PSA消融实验
nc: 4 # number of classes (Diseased, Insect-damaged, Bird-pecked, Cracked)
scales:
  n: [0.50, 0.25, 1024]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, SimAM, []]  # 5-在P3后添加SimAM注意力
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]  # 7
  - [-1, 1, Conv, [1024, 3, 2]]  # 8-P5/32
  - [-1, 2, C2PSA, [1024]]  # 9-关键改动：使用C2PSA替代A2C2f

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 7], 1, Concat, [1]]  # 11-cat backbone P4 (第7层)
  - [-1, 2, A2C2f, [512, False, -1]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 5], 1, Concat, [1]]  # 14-cat backbone P3 (第5层，SimAM后)
  - [-1, 2, A2C2f, [256, False, -1]]  # 15

  - [-1, 1, Conv, [256, 3, 2]]  # 16
  - [[-1, 12], 1, Concat, [1]]  # 17-cat head P4 (第12层)
  - [-1, 2, A2C2f, [512, False, -1]]  # 18

  - [-1, 1, Conv, [512, 3, 2]]  # 19
  - [[-1, 9], 1, Concat, [1]]  # 20-cat head P5 (第9层C2PSA后)
  - [-1, 2, C3k2, [1024, True]]  # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]  # 22-Detect(P3, P4, P5)